#include <iostream>
#include <stdio.h>

#include <stdlib.h>

#include <string.h>

#include <Windows.h>
#include <conio.h>

using namespace std;
int map[15][15] = {
	1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,
	0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,
	1,1,1,1,0,1,1,1,1,1,0,1,1,1,1,
	1,1,1,1,0,1,1,1,1,1,0,1,1,1,1,
	1,1,1,1,0,1,1,1,1,1,0,1,1,1,1,
	1,1,1,1,0,1,1,1,1,1,0,1,1,1,1,
	1,1,1,1,0,1,1,1,1,1,0,1,1,1,1,
	1,1,1,1,0,1,1,1,1,1,0,1,1,1,1,
	1,1,1,1,1,1,1,1,1,1,0,1,1,1,1,
	1,1,1,1,1,1,1,1,1,1,0,0,0,1,1,
	1,1,1,1,1,1,1,1,1,1,0,1,1,1,1,
	1,1,1,1,1,1,1,1,1,1,0,1,1,1,1,
	1,1,1,1,1,1,1,1,1,1,0,0,0,0,0,
	1,1,1,1,1,1,1,1,1,1,0,1,1,1,1,
	1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,
};

int main(void) {
	int i, k;
	int x, y;
	int head;// 진행방향 1~4
	head = 1;
	x = 14;
	y = 12; // 시작점 위치

	map[y][x] = 2;
	int value;
	// 배열안에 저장된 값 1,0 => 0 움직일 수 있다, 1 벽이다
	do {
		for (i = 0; i < 15; ++i) {
			for (k = 0; k < 15; ++k) {
				value = map[i][k];
				printf("%s", (value == 0) ? "  " :
					(value == 1) ? "■" : "★"); // 저장된 것은 1,0이지만 출력시 필터를 어떻게 하느냐에 따라 다른값으로 나와
										 // (맞으면)?이거 : 아니면이거 하는 수식
						}
						printf("\n");
		}

		// 출력 후
		map[y][x] = 0;

	// 한쪽법칙(왼쪽 = 진행방향4가지 1R 2D 3L 4U)
		if (_kbhit()) { // 1. 키보드 입력이 감지되면
			int pressedKey = _getch(); // 2. 아스키 코드 값을 가져오고
			switch (pressedKey) { // 3. 입력받은 키에 해당하는 동작을 수행한다.
			case 72:
				if (map[y][x - 1] == 0) {
					x--;
					head = 3;
				}
				else {
					head = 1;
				}
				break;

			case 80:
				if (map[y][x + 1] == 0) {
					x++;
					head = 1;
				}
				else {
					head = 3;
				}

				break;
			case 75:
				if (map[y + 1][x] == 0) {
					y++;
					head = 2;
				}

				else {
					head = 4;
				}

				break;
			case 77:
				if (map[y - 1][x] == 0) {
					y--;
					head = 4;
				}

				else {
					head = 2;
				}
				break;
			}
		}

		//1,2번 조건 두개 다 실행시키면 제자리걸음		

		map[y][x] = 2;



		getchar();

		system("cls");

	} while (!(y == 12 && x == 14));

	return 0;

}



#if 0
int main() {
	int ix, iy;
	int map[10][10] = { {1,1,1,1,1,1,1,1,1,1},
						{1,1,1,1,1,1,1,1,1,1},
						{0,0,0,0,0,0,0,1,1,1},
						{1,1,1,1,1,1,0,1,1,1},
						{1,1,1,1,1,1,0,1,1,1},
						{1,1,1,1,1,1,0,1,1,1},
						{1,1,1,1,1,1,0,1,1,1},
						{1,1,1,1,1,1,0,1,1,1},
						{1,1,1,1,1,1,0,0,0,0},
						{1,1,1,1,1,1,1,1,1,1} };

	int i, j;
	for (i = 0; i < 10; i++) {
		for (j = 0; j < 10; j++) {
			if (map[i][j] == 1)
				printf("■");
			else
				printf("  ");
		}
		cout << endl;
	}
	
	/*printf(i = 0; i < 20; i++) {
		printf(j = 0; j < 20; j++) {
			if (j == 1)
				printf(" ");
			else
				printf(" ");
		}
	}*/


}
#endif